app/controllers/common_items_controller.rb

  def index
    @common_items = CommonItem.all
---
SELECT "common_items".* FROM "common_items"

  def create
    @common_item = CommonItem.new(common_item_params)

    if @common_item.save
---
INSERT INTO "common_items" ("name", "variety", "details", "price", "mfg_date", "expiry_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    find_common_item
    @common_item.destroy
---
DELETE FROM "common_items" WHERE "common_items"."id" = $1  [["id", 1]]

    def find_common_item
      @common_item = CommonItem.find(params[:id])
---
SELECT "common_items".* FROM "common_items" WHERE "common_items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]