app/controllers/home_controller.rb

  def index
    @vegetables = Vegetable.all
    @common_items = CommonItem.all
    @leafy_greens = LeafyGreen.all
---
SELECT "vegetables".* FROM "vegetables"
SELECT "common_items".* FROM "common_items"
SELECT "leafy_greens".* FROM "leafy_greens"