app/controllers/leafy_greens_controller.rb

SELECT "leafy_greens".* FROM "leafy_greens"
---
  def index
    @leafy_greens = LeafyGreen.all

DELETE FROM "leafy_greens" WHERE "leafy_greens"."id" = $1  [["id", 3]]
---
  def destroy
    find_leafy_green
    @leafy_green.destroy

SELECT "leafy_greens".* FROM "leafy_greens" WHERE "leafy_greens"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_leafy_green
      @leafy_green = LeafyGreen.find(params[:id])