app/controllers/products_controller.rb

  def index
    if params[:query].present?
      search
    else
      @products = Product.all
---
SELECT "products".* FROM "products" WHERE (name ILIKE '%potato%' OR details ILIKE '%potato%')

    def find_product
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]