app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "admin2@admin.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email_address: params[:email_address])