app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email_address", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "admin2"], ["email_address", "admin2@admin.com"], ["created_at", "2024-06-10 08:41:37.270029"], ["updated_at", "2024-06-10 08:41:37.270029"], ["password_digest", "[FILTERED]"]]