app/controllers/vegetables_controller.rb

SELECT "vegetables".* FROM "vegetables"
---
  def index
    @vegetables = Vegetable.all

INSERT INTO "vegetables" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bean"], ["description", "jjjjjdjdjdjdjd"], ["created_at", "2024-05-08 06:59:43.275769"], ["updated_at", "2024-05-08 06:59:43.275769"]]
---
  def create
    @vegetable = Vegetable.new(vegetable_params)

    if @vegetable.save

UPDATE "vegetables" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "vegetables"."id" = $4  [["name", "2024"], ["description", "mmalkkijijmkeek"], ["updated_at", "2024-05-09 03:26:52.692345"], ["id", 6]]
---
  def update
    find_vegetable
    if @vegetable.update(vegetable_params)

DELETE FROM "vegetables" WHERE "vegetables"."id" = $1  [["id", 3]]
---
  def destroy
    find_vegetable
    @vegetable.destroy

SELECT "vegetables".* FROM "vegetables" WHERE "vegetables"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_vegetable
      @vegetable = Vegetable.find(params[:id])